test/Lagrangian/tracer/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

linear
{
    type        tracerCloud;
    libs        ("libLagrangianCloud.so");
    executeControl timeStep;
    writeControl writeTime;
}

parabolic
{
    type        tracerCloud;
    libs        ("libLagrangianCloud.so");
    executeControl timeStep;
    writeControl writeTime;
}

linearAge
{
    type        cloudAge;
    libs        ("libLagrangianCloudFunctionObjects.so");
    cloud       linear;
}

parabolicAge
{
    type        cloudAge;
    libs        ("libLagrangianCloudFunctionObjects.so");
    cloud       parabolic;
}

// ************************************************************************* //
